# First Question Answer:

In [9]:
# five function of pandas:
#1.pd.read_csv
#2.df.head
#3.df.columns
#4.df.len
#5.df.iloc

In [10]:
# first function apply
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [11]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
# second funtion apply:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
# third function apply:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
# fourth function apply:
len(df)

891

In [15]:
#fifth function apply:
df.iloc[1:6][1:23:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [74]:
df= pd.DataFrame({'A' :[3,8,6,2,9],
      'B' :[5,2,9,3,1],
      'C' :[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [83]:
def reindex_with_increment(df):
    # Calculate the length of the DataFrame
    length = len(df)

    # Create a new index using the range function with the desired increment
    new_index = range(1, 2*length+1 , 2)

    # Set the new index for the DataFrame
    df.index = new_index

    return df

In [84]:
df
new_df =reindex_with_increment(df)
print(new_df)

   A  B  C
1  3  5  1
3  8  2  7
5  6  9  4
7  2  3  5
9  9  1  2

#Third Question Answer:

In [53]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

In [54]:
def calculate_sum_of_first_three_values(df):

    first_three_values = df['Values'].iloc[:3]

 
    total_sum = first_three_values.sum()

    
    print("Sum of the first three values:", total_sum)


calculate_sum_of_first_three_values(df)

Sum of the first three values: 60

# Fourth Question Solved:

In [64]:
df=pd.DataFrame({'Text':['This is a sample text.', 'This is a beautiful city.', 'One more text.']})

In [65]:
import pandas as pd

def add_word_count_column(df):
    # Split the 'Text' column by whitespace and count the number of resulting words
    df['Word_Count'] = df['Text'].str.split().apply(len)

    return df

In [66]:
add_word_count_column(df)

                        Text  Word_Count
0     This is a sample text.           5
1  This is a beautiful city.           5
2             One more text.           3

In [16]:
# fifth question:
#The size property returns the number of elements in the DataFrame. The number of elements is the number of rows  the number of columns.
#The shape of a DataFrame is a tuple of array dimensions that tells the number of rows and columns of a given DataFrame.

In [17]:
# sixth question:
#for read excel file this function pd.read_excel() is used.

In [40]:
# seventh question :
df= { "email_id" : ["llok.sri852@gmai.com",'harsh.srivastav@gmail.com'],
         'username' : ['llok.sri','harsh.sri']}

In [41]:
pd.DataFrame(df)

                    email_id   username
0       llok.sri852@gmai.com   llok.sri
1  harsh.srivastav@gmail.com  harsh.sri

In [43]:
df['new_username'] =df['username']

In [44]:
pd.DataFrame(df)

                    email_id   username new_username
0       llok.sri852@gmai.com   llok.sri     llok.sri
1  harsh.srivastav@gmail.com  harsh.sri    harsh.sri

In [38]:
pd.DataFrame(df)

     name  values
0  lokesh      10
1   harsh      20
2  ashish      30
3   mohan      40

#Eight Question Answer:

In [ ]:
df= {'A' :[3,8,6,2,9],
      'B' :[5,2,9,3,1],
      'C' :[1,7,4,5,2]}

In [30]:
import numpy as np
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows
df = pd.DataFrame({"A":[3,8,6,2,9] ,"B":[5,2,9,3,1], "C":[1,7,4,5,2]})
selected_df = select_rows(df)
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#Ninth Question Answer:

In [31]:
def calculate_stats(df,column_name):
    column_values=df[column_name].values
    mean=np.mean(column_values)
    median=np.median(column_values)
    std_dev=np.std(column_values)
    return {"mean":mean, "median":median, "standard_deviation":std_dev}

In [32]:
data ={"name":["lokesh","harsh","ashish","mohan"],"values":[10,20,30,40]}
df=pd.DataFrame(data)

In [33]:
stats=calculate_stats(df,"values")
print(stats)

{'mean': 25.0, 'median': 25.0, 'standard_deviation': 11.180339887498949}

Eleventh Question Answer:

In [88]:
df=pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})

In [ ]:
def add_weekday_column(df):
    # Convert the 'Date' column to a datetime data type
    df['Date'] = pd.to_datetime(df['Date'])

    # Extract the weekday name and add it as a new column 'Weekday'
    df['Weekday'] = df['Date'].dt.strftime('%A') # dt.strftime('%A') method to extract the weekday name as a string and add it as a new column 'Weekday'
    return df

In [89]:
add_weekday_column(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [90]:
def select_rows_between_dates(df):
    # Convert the 'Date' column to a datetime data type
    df['Date'] = pd.to_datetime(df['Date'])

    # Create a boolean mask for rows between '2023-01-01' and '2023-01-31'
    mask = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')
# a boolean mask mask to identify rows with dates falling between '2023-01-01' and '2023-01-31' using the logical & (AND) 
    # Select the rows that satisfy the condition
    selected_rows = df[mask]

    return selected_rows

In [91]:
df = pd.DataFrame({'Date': ['2023-01-15', '2023-01-20', '2023-02-05', '2023-01-10']})
select_rows_between_dates(df)

        Date
0 2023-01-15
1 2023-01-20
3 2023-01-10